package uz.testproject.controller;

import lombok.RequiredArgsConstructor;
import lombok.extern.slf4j.Slf4j;
import org.springframework.http.ResponseEntity;
import org.springframework.web.bind.annotation.*;
import uz.testproject.payload.NewsPayload;
import uz.testproject.service.NewsService;

import java.util.ArrayList;
import java.util.List;

@RestController
@RequestMapping("/api/news")
@RequiredArgsConstructor
@Slf4j
@CrossOrigin(origins = "*")
public class NewsController {

    private final NewsService newsService;

    @PostMapping("/save")
    public ResponseEntity<?> saveNews(@RequestBody NewsPayload payload) {
        return newsService.addNews(payload);
    }

    @PutMapping("/edit")
    public ResponseEntity<?> editNews(@RequestBody NewsPayload payload) {
        return newsService.editNews(payload);
    }

    @PutMapping("/edit/hashId")
    public ResponseEntity<?> editNewsHashId(@RequestBody NewsPayload payload) {
        return newsService.editNewsHashId(payload);
    }

    @GetMapping("/")
    public ResponseEntity<?> getNewsListPage(@RequestParam(defaultValue = "0") int page, @RequestParam(defaultValue = "4") int size) {
        return newsService.getPage(page, size);
    }

    @DeleteMapping("/{newsId}")
    public boolean deleteNewsId(@PathVariable("newsId") Long id) {
        return newsService.deleteById(id);
    }

    @GetMapping("/all")
    public ResponseEntity<?> allNews() {
        return newsService.getAllNews();
    }

    @GetMapping("/{newsid}")
    public ResponseEntity<?> NewsIdBody(@PathVariable("newsid") Long id) {
        return newsService.getNewsBody(id);
    }

    @PostMapping("/")
    public ResponseEntity<?> saveNewsList() {
        List<NewsPayload> payloadList = new ArrayList<>();

        NewsPayload newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Марказга ишга қабул қилиш тартиби");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<p>1. Адлия органлари ва муассасаларига ходимларни ишга қабул қилиш бўйича танлов (бундан буён матнда танлов деб юритилади) адлия органлари ва муассасаларининг кадрлар таркибини ишчанлик, шахсий ва ахлоқий фазилатлари, маълумоти даражаси<br>ва соғлиғига кўра юклатилган вазифа ва функцияларни бажаришга лаёқатли бўлган ходимлар билан таъминлаш мақсадида ўтказилади.<br>2. Танлов адлия органлари ва муассасаларининг раҳбарлари томонидан ташкил этиладиган махсус комиссия томонидан меритократия, очиқлик ва мустақиллик тамойиллари асосида ўтказилади.<br>Махсус комиссия тегишли адлия органи ёки муассасаси ходимлари орасидан камида беш кишидан иборат таркибда бир йил муддатга тузилади.<br>Махсус комиссия таркибига келишувга асосан марказий аппарат ходимлари, ҳуқуқни муҳофаза қилувчи органлар, суд ва жамоатчилик вакиллари киритилиши мумкин.<br>3. Махсус комиссия раис раҳбарлигида фаолият кўрсатади.<br>Адлия органлари ва муассасаларида тегишли раҳбар махсус комиссия раиси ҳисобланади. Махсус комиссия таркибига киритилган раҳбар ўринбосарларидан бири комиссия раиси ўринбосари этиб тайинланади.<br>Адлия вазирлигининг махсус комиссияси таркиби адлия вазири томонидан тасдиқланади.<br>Адлия вазирлигининг махсус комиссиясининг ва Махсус комиссиясининг ишчи органи ҳамда махсус комиссия котиби адлия органлари ва муассасаларининг кадрлар соҳасига масъул таркибий бўлинмаси (бундан буён матнда Ишчи орган деб юритилади) ҳисобланади. Махсус комиссия йиғилиши аъзоларининг камида 2/3 (учдан икки) қисми қатнашган тақдирда ваколатли ҳисобланади.<br>4. Танлов қуйидаги босқичлардан иборат:<br>номзод билан унинг назарий билимлари ва касбий лаёқатини аниқлаш юзасидан суҳбат ўтказиш;<br>вазирлик номенклатурасига кирадиган лавозимлар бўйича номзодни марказий аппарат билан келишиш.<br>5. Танлов жараёнлари аудио ва видеоёзувларда қайд этиб борилади ҳамда Ўзбекистон Республикаси Адлия вазирлигининг расмий веб-сайтида реал вақт режимида трансляция қилинади.<br>Танлов жараёнлари ўтказилаётган жойда Махсус комиссия аъзолари, Ишчи орган вакиллари ва номзоддан ташқари бегона шахсларнинг ҳозир бўлишига рухсат берилмайди.<br>6. Ўтказилган ҳар бир танлов бўйича материаллар, шу жумладан танлов ўтказиш жараёни қайд этилган аудио ва видеоёзувлар ёзилган сақлаш қурилмаларда (дисклар) Ишчи органнинг алоҳида йиғмажилдига тикилади ва бир йил давомида сақланади.<br>7. Ҳар ой якунлангач кейинги ойнинг 10 санасига қадар вакант лавозимларга танлов ўтказиш тўғрисидаги эълон тегишли адлия органи ва муассасасининг расмий<br>веб-сайтида жойлаштирилади ёки бошқа босма нашрларда чоп этилади.<br>8. Ишчи орган раҳбар билан келишилган ҳолда номзодларга қўйиладиган малака<br>ва бошқа талаблар акс эттирилган бўш иш ўрнига танлов ўтказилиши ҳақидаги эълон матнини тайёрлайди ва Жамоатчилик билан алоқалар бўлимининг соҳавий функциясини бажариш юклатилган таркибий бўлинмага тақдим этади.<br>Жамоатчилик билан алоқалар бўлимининг соҳавий функциясини бажариш юклатилган таркибий бўлинма эълон матни келиб тушган кундан бошлаб бир иш куни мобайнида эълонни матнини тегишли расмий веб-сайтда жойлаштирилишини таъминлайди.<br>9. Танлов ўтказиш тўғрисидаги эълонда қуйидагилар кўрсатилиши лозим:<br>танлов ўтказилаётган лавозим;<br>танловда иштирок этувчиларга лавозим бўйича номзодга қўйиладиган талаблар;<br>танловда иштирок этиш учун тақдим этиладиган ҳужжатлар ва уларни тақдим этишнинг охирги санаси;<br>боғланиш учун телефон рақам ва электрон почта манзили;<br>танлов ўтказиладиган жой;<br>адлия органлари ва муассасаларининг расмий веб-сайтларида жойлаштирилган саволларга ҳавола;<br>танлов тартиби бузилган тақдирда ёки коррупция ҳолатлари ҳақидаги хабарларни Адлия вазирлигининг &ldquo;1008&rdquo; ишонч телефонига, адлия органлари томонидан ўрнатилган бошқа телефон рақамларга ва @antikorbot телеграм каналига мурожаат қилиш тартиби.<br>Агар танлов ходимнинг бола парваришлаш таътилига чиқиши муносабати билан бўш иш ўрнига ўтказилаётган бўлса, эълонда бу ҳақда кўрсатиб ўтилиши лозим.<br>10. Танловга ҳужжатларни топшириш муддати эълон тегишли расмий веб-сайтда жойлаштирилган кундан бошлаб камида ўн беш календарь кунни ташкил этиши лозим.<br>11. Танловда иштирок этиш истагини билдирган номзодлар ушбу Низомнинг<br>6-иловасига мувофиқ шаклда ариза билан тегишли адлия органи ёки муассасасига мурожаат қилади.<br>12. Танловда иштирок этиш тўғрисидаги аризага қуйидаги ҳужжатлар илова қилинади:<br>ходимнинг шахсий варақаси (ушбу Низомнинг 29-иловасига мувофиқ маълумотнома-объективка);<br>диплом (дипломдан кўчирма)нинг нусхаси, чет элда ўқиган бўлса, дипломи тан олиш ва нострификациядан ўтганлигини тасдиқловчи гувоҳнома, олий ёки ўрта махсус, касб-ҳунар таълим муассасаларининг битирувчи курсларида таълим олаётганлар бундан мустасно;<br>номзоднинг паспорт нусхаси.<br>Ариза ва унга илова қилинган ҳужжатлар электрон шаклда юборилиши ҳам мумкин.<br>13. Танловда иштирок этиш учун тақдим этилган ариза ва унга илова қилинган ҳужжатлар белгиланган тартибда тегишли адлия органи ёки муассасасининг девонхонасида рўйхатдан ўтказилади.<br>14. Ишчи орган томонидан эълонда белгиланган ҳужжат қабул қилиш муддати тугагандан сўнг 15 календарь кун муддатда номзоднинг ҳужжатлари ушбу Низомнинг<br>5-банди ва лавозимга қўйиладиган малака талабларига мувофиқ келиши, иш жойи ва ўқиш жойидан номзод ҳақидаги маълумотларни дастлабки тарзда ўрганиб чиқилиши лозим. Ўрганиб чиқиш натижаларига кўра, Ишчи орган Махсус комиссия раиси билан келишилган ҳолда танлов ўтказиш кунини белгилайди.<br>Танлов ўтказиш куни, вақти ва жойи ҳақидаги хабарнома номзодга танлов ўтказиладиган кундан камида беш кун олдин электрон ёки ёзма равишда юборилади.<br>Танлов куни аниқ бўлгандан сўнг бир иш кунида адлия органлари ва муассасалари мавжуд вакант лавозим бўйича ўтказиладиган танловда иштирок этадиган номзодлар рўйхатини ва улар ҳақидаги маълумотларни марказий аппаратнинг Кадрлар бошқармасига электрон кўринишда юборади.<br>Ўрганиш жараёнида номзодни адлия органлари ва муассасаларига ишга қабул қилиш учун тўсқинлик қилувчи ҳолатлар қонун ҳужжатларида мавжудлиги аниқланса, номзодга бу ҳақда асослантирилган жавоб хати Ишчи орган томонидан тайёрланади<br>ва Махсус комиссия раиси томонидан имзоланиб, номзодга юборилади.<br>15. Номзод ўзининг аризасига асосан танловда иштирок этишдан бош тортган тақдирда тақдим этилган ҳужжатлар қайтариб берилади.<br>Номзод ушбу Низомнинг 5-бандида назарда тутилган талабларга мос келмаганда, ишга кириш учун ҳужжатлар ўз вақтида тўлиқ тақдим қилинмаганда ёки била туриб сохта ҳужжатлар ёхуд ёлғон маълумотлар тақдим этилган тақдирда номзодни ишга қабул қилиш рад этилади.<br>Ишга қабул қилинган ходим томонидан ишга кириш жараёнида била туриб сохта ҳужжатлар ёхуд ёлғон маълумотлар тақдим этилганлиги аниқланган ҳолларда ушбу ходимни хатти-ҳаракатлари юзасидан хизмат текшируви ўтказилади ҳамда унинг хатти-ҳаракатларига ҳуқуқий баҳо бериш учун тўпланган ҳужжатлар прокуратура органига юборилади.<br>16. Танлов бошлангунга қадар Ишчи орган томонидан номзоддан соғлиғи ҳолати сўралади. Ўзини ёмон ҳис қилаётганидан шикоят қилган номзодлар танловга қўйилмайди. Бундай ҳолатда далолатнома тузилади ва унга навбатдаги танловда иштирок этиш ҳуқуқи тушунтирилади.<br>17. Ишчи орган Махсус комиссия аъзолари ва номзодларга вакант лавозимлар ҳақидаги эълон жойлаштирилган жой ва сана, ҳужжатларни топшириш муддатлари, танловда иштирок этиш учун келиб тушган аризалар сони, шундан рад қилинганлар<br>ва уларнинг сабабларини ҳамда танлов куни ҳозир бўлган номзодларнинг рўйхатини ўқиб эшиттиради.<br>18. Тест саволлари 20 хил вариантда 30 тадан савол, ҳар бир саволга 4 та (&ldquo;А&rdquo;, &ldquo;B&rdquo;, &ldquo;C&rdquo;, &ldquo;D&rdquo;) жавоблардан иборат бўлиб, Ишчи орган томонидан давлат тилида тайёрланади.<br>Тест синови соҳа хусусиятини инобатга олиб ўрта махсус ёки олий таълимнинг тегишли йўналишидаги фанларнинг ўқув дастурларига мувофиқ, мантиқий фикрлаш, ахборотни тизимга солиш, уни таҳлил қилиш ва умумлаштириш, амалий миқдорий масалаларни ечиш қобилиятини баҳолашга қаратилган саволлардан иборат бўлади.<br>Бунда саволлар ҳуқуқий, сиёсий, мантиқий, қиёсий турларга бўлинади. Ҳуқуқий саволлар номзоднинг ҳуқуқий соҳадаги билимларини, сиёсий саволлар амалга оширилаётган сиёсий жараёнлардан хабардорлигини аниқлашга қаратилган бўлса, мантиқий саволлар муайян шарт-шароитдан келиб чиқиб, аниқ фикрлаш ва тўғри хулоса чиқариш, сонли ва шаклли қонуниятларга эътибор беришга, қиёсий саволлар эса, ўзаро боғлиқликни ҳамда турли тушунча ва жараёнлар ўртасидаги ўхшашликни сезиш қобилиятини аниқлашга қаратилган.<br>19. Тест саволлари, уларнинг жавоблари ва жавоблар бланкалари Ишчи органида сақланади ҳамда у саволлар ва жавобларнинг тўғрилиги, тестлар ва жавобларнинг ошкор бўлиб кетмаслиги учун масъул ҳисобланади.<br>20. Ишчи орган томонидан номзодга тест синовлари ўтказишнинг қисқача мақсади, мазмуни ва тартиби тушунтирилади. Шундан сўнг номзодга тест саволлари вариантини танлаш таклиф қилинади ва мазкур Низомнинг 7-иловасига мувофиқ шаклдаги жавоблар варақаси тарқатилади. Ҳар бир жавоб варақаси Махсус комиссия раиси томонидан тасдиқланган бўлиши лозим.<br>21. Номзодга тест саволларига жавоб бериш учун 30 дақиқа вақт берилади.<br>Ҳар бир тест саволига фақат битта жавоб белгиланиши лозим. Жавоблар варақасининг тўғри тўлдирилиши учун номзод шахсан жавобгар ҳисобланади.<br>Тўлдирилган жавоблар варақаси номзоднинг билим даражасини белгиловчи ҳужжат ҳисобланади ва унинг шахсий ҳужжатлари билан бирга сақланади.<br>22. Тест саволларига жавоб бериш жараёнида номзодларга қуйидагилар тақиқланади:<br>қонун ҳужжатларидан, маълумот берувчи ва махсус адабиётлардан, ҳар қандай турдаги техника воситаларидан ёки бошқа материаллардан (маълумотлардан) фойдаланиш;<br>бошқа шахслар билан суҳбатлашиш;<br>жавоблар варақасини топширгунга қадар тест саволлари ўтказилаётган хонадан рухсатсиз ташқарига чиқиш.<br>Мазкур талабларга риоя қилмаган номзод тест жараёнини ўтказиш тартибини бузган деб топилади ва уни танловда қатнашишдан четлаштириш учун асос бўлади. Ушбу ҳолатда Ишчи орган томонидан мазкур Низомнинг 9-иловасига мувофиқ шаклда далолатнома расмийлаштирилади ва комиссия аъзолари томонидан имзоланади.<br>23. Жавоблар варақаси синов учун белгиланган вақт тугагунга қадар ёки тугаши билан синов кузатувчиси бўлган Ишчи органга топширилади.<br>Ишчи орган номзоддан жавоблар варақасини олгандан сўнг тест синови натижасида тўпланган балларни Комиссия раисига ва номзодга ўқиб эшиттиради. Бунда номзодларнинг ҳар бир тўғри жавоби учун бир балл берилади.<br>24. Тест синови натижасига кўра камида 71 фоиз саволларга тўғри жавоб берган номзод кейинги босқичга, яъни номзоднинг назарий билимлари ва касбий лаёқатини аниқлаш юзасидан суҳбатга чақирилади.<br>25. Номзоднинг назарий билимлари ва касбий лаёқатини аниқлаш, унинг лавозим касб фаолиятига боғлиқ қонунчилик соҳаси, умумий қонунчилик асослари, амалиётда кўп учрайдиган муаммоли ҳолатлар (казуслар)нинг ечими бўйича суҳбат ўтказилади.<br>Бунда номзод саволлар қўйилган учта қутичадан бир донадан саволларни жами<br>учта саволни тасодифий танлаш йўли билан олади. Қутичадан олинган саволларни ўзгартиришга йўл қўйилмайди.<br>Ҳар бир қутича ичида 50 тадан саволлар жойлаштирилади.<br>Саволларга тайёрланиш учун номзодларга 10 дақиқагача вақт ажратилади.<br>26. Номзод тушган саволларга жавоб бера олмаса ёки берилган жавоблар асосида номзоднинг билим даражасини аниқлашнинг имконияти бўлмаса, Махсус комиссия раисининг рухсати билан қўшимча саволлар берилиши мумкин. Қўшимча саволлар олдинги саволларга берилган жавобларни аниқлаштириш мақсадида берилиши ва олдинги саволлар доирасидан четга чиқмаслиги лозим.<br>Номзод томонидан берилган жавоблар аниқ, лўнда ва айнан савол мазмуни билан мос бўлиши ҳамда битта саволга жавоб бериш давомийлиги икки дақиқадан ошмаслиги лозим. Қўшимча саволлар берилган ҳолатларда суҳбат давомийлиги яна ўн дақиқагача узайтирилиши мумкин.<br>27. Танлов эълон қилинган бўш иш ўрнининг хусусиятидан келиб чиққан ҳолда бошқа соҳа мутахассислари ҳам номзодга саволлар бериш ва жавоблар бўйича<br>ўз хулосасини баён этиш учун овоз бериш ҳуқуқисиз таклиф этилиши мумкин.<br>28. Тест синовида ва суҳбатда бериладиган саволлар рўйхати Махсус комиссия раиси томонидан тасдиқланиб, вазирликнинг расмий веб-сайтида эълон қилинади ҳамда қонунчиликда, шунингдек жамиятнинг ижтимоий-иқтисодий ва сиёсий ҳаётида бўлаётган муҳим ўзгаришлардан келиб чиққан ҳолда ҳар йили янгилаб борилади.<br>29. Суҳбат натижалари бўйича ҳар бир савол ўн баллик тизимда баҳоланади.<br>Жавобларни баҳолаш қуйидаги мезонлар асосида амалга оширилади:<br>0 балл &ndash; саволга жавоб беролмаслик;<br>1-3 балл &ndash; савол бўйича умумий тушунчага эга эмаслиги;<br>4-7 балл &ndash; саволга умумий ёки қисман жавоб бериш;<br>8-10 балл &ndash; саволга тўлиқ ва атрофлича жавоб бериш.<br>Бунда Махсус комиссия аъзоларининг ҳар бири суҳбат натижаси бўйича ҳар бир савол юзасидан номзодга мазкур Низомнинг 8-иловасига мувофиқ шаклдаги баҳолаш варақасига балл қўяди. Махсус комиссиянинг ҳар бир аъзоси алоҳида баҳолаш варақасини тўлдиради. Баҳолаш варақасини комиссиянинг бошқа аъзоларига кўрсатиш тақиқланади ва балларни ўзгартиришга йўл қўйилмайди.<br>30. Суҳбат якунлари бўйича комиссия аъзолари томонидан номзодга қўйилган баллар Низомнинг 8-иловасидаги жадвалга мувофиқ умумлаштириш ва ўртача балл ҳисоблаб чиқариш учун Ишчи органга берилади. Ишчи орган томонидан номзодга қўйилган баллар мазкур Низомнинг 7-иловасига мувофиқ шаклдаги жавоблар варақасига қайд қилинади.<br>Номзод томонидан тўпланиши мумкин бўлган энг юқори баллнинг 56 фоизи ва ундан юқорисини тўплаганда номзод лавозимга тавсия этилади. Номзод томонидан тўпланиши мумкин бўлган энг юқори баллнинг 55 фоизидан кам балл тўплаганда комиссия аъзолари томонидан номзод суҳбатдан ўтмаган деб эътироф этилади.<br>31. Махсус комиссия суҳбат натижасига мувофиқ номзодни топширган вакант лавозимдан бошқа бир вакант лавозимга ишга қабул қилишга тавсия қилиш ҳуқуқига эга.<br>32. Танлов якунлари бўйича Махсус комиссия хулоса қабул қилади.<br>Хулосада қуйидагилар кўрсатилади:<br>рақами ва қабул қилинган санаси;<br>иштирок этган Махсус комиссия аъзолари рўйхати;<br>танлов натижалари;<br>номзодга тушган саволлар;<br>танловда ғолиб деб топилган номзодлар рўйхати;<br>Махсус комиссия хулосаси устидан шикоят қилиш тартиби.<br>Жавоблар варақалари ҳамда баҳолаш варақаси Махсус комиссия хулосасига илова қилинади.<br>Махсус комиссия хулосаси Ишчи орган томонидан расмийлаштирилади ҳамда раис томонидан тасдиқланади.<br>33. Номзод томонидан тўпланган баллар, баҳолаш натижалари ҳамда комиссия хулосаси шу куннинг ўзида танловда иштирок этган номзодларга ўқиб эшиттирилади.<br>34. Танлов натижаларидан норози бўлган номзод ўн кун муддат ичида адлия вазирига, шунингдек судга шикоят билан мурожаат қилиши мумкин.<br>Танлов натижаларидан норози бўлган номзоднинг мурожаатини кўриб чиқиш жараёнида Махсус комиссия томонидан меҳнат қонунчилиги ҳамда танлов ўтказиш тартибига риоя қилинганлиги, шунингдек номзоднинг танлов натижасига боғлиқ бўлган танлов ўтказиш жараёнидаги қонунбузилишларга оид важлари ўрганилади. Натижаси бўйича марказий аппаратнинг Кадрлар бошқармаси томонидан мурожаат муаллифига жавоб хат юборилади.<br>35. Махсус комиссия томонидан ўтказиладиган танловнинг ижобий натижаларига кўра номзодга бўш иш ўринга ёки жамоатчи ёрдамчиликка ишга киришга тавсия этилиши мумкин.<br>Адлия органлари ва муассасаларининг вазирлик номенклатурасига кирувчи лавозимларига Махсус комиссия томонидан ишга қабул қилишга тавсия қилинган номзодлар вазирлик билан келишилгандан сўнг вазирликнинг розилик хати ёки тегишли буйруғига асосан ишга қабул қилинади.<br>Мутахассислиги бўйича етарли иш тажрибасига эга бўлмаган номзодлар касбий фаолиятга ва келгусида бўш иш ўринларга муносиб номзодлар этиб тайёрлаш мақсадида жамоатчи ёрдамчиликка қабул қилинади.</p>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Давлат суд-экспертиза муассасалари ҳақида маълумот");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<table width=\"1217\">\n" +
                "    <tbody>\n" +
                "        <tr>\n" +
                "            <td width=\"10\"><strong>№</strong></td>\n" +
                "            <td width=\"606\"><strong>Экспертиза муассасаси номи</strong></td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"10\"><strong>1.&nbsp;</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Адлия вазирлиги ҳузуридаги Х.&nbsp;Сулаймонова номидаги суд экспертиза маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>2.</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Ички Ишлар вазирлиги Экспертиза-криминалистика Бош маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>3.</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Соғлиқни сақлаш вазирлиги ҳузуридаги Республика суд-тиббий экспертиза илмий амалий маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>4.&nbsp;</strong></td>\n" +
                "            <td width=\"606\">Давлат хавфсизлиги хизмати Экспертиза-криминалистика маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>5.</strong></td>\n" +
                "            <td width=\"606\">Электрон технологияларини ривожлантириш маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>6.</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Қуролли Кучлари Суд-тиббий экспертиза маркази</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>7.</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Давлат Божхона Қўмитаси Марказий божхона лабораторияси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><strong>8.</strong></td>\n" +
                "            <td width=\"606\">Ўзбекистон Республикаси Фавқулотда вазиятлар вазирлиги экспертиза бўлинмаси</td>\n" +
                "        </tr>\n" +
                "    </tbody>\n" +
                "</table>");
        payloadList.add(newsPayload);


        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("НОДАВЛАТ СУД-ЭКСПЕРТИЗА ТАШКИЛОТЛАРИ");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<table width=\"1217\">\n" +
                "    <tbody>\n" +
                "        <tr>\n" +
                "            <td width=\"10\">\n" +
                "                <table width=\"1042\">\n" +
                "                    <tbody>\n" +
                "                        <tr>\n" +
                "                            <td width=\"74\">\n" +
                "                                <p><strong>№</strong></p>\n" +
                "                            </td>\n" +
                "                            <td width=\"592\">\n" +
                "                                <p><strong>Экспертиза ташкилоти номи</strong></p>\n" +
                "                            </td>\n" +
                "                        </tr>\n" +
                "                        <tr>\n" +
                "                            <td width=\"74\"><strong>1.&nbsp;</strong></td>\n" +
                "                            <td width=\"592\">&ldquo;PROEX&rdquo; нодавлат суд экспертиза ташкилоти МЧЖ</td>\n" +
                "                        </tr>\n" +
                "                        <tr>\n" +
                "                            <td width=\"74\"><strong>2.</strong></td>\n" +
                "                            <td width=\"592\">&ldquo;GARANT&rdquo; нодавлат суд экспертиза ташкилоти МЧЖ</td>\n" +
                "                        </tr>\n" +
                "                        <tr>\n" +
                "                            <td width=\"74\"><strong>3.</strong></td>\n" +
                "                            <td width=\"592\">\n" +
                "                                <p>&ldquo;SUD EKSPERT&rdquo; нодавлат суд экспертиза ташкилоти МЧЖ</p>\n" +
                "                            </td>\n" +
                "                        </tr>\n" +
                "                    </tbody>\n" +
                "                </table><br>\n" +
                "            </td>\n" +
                "            <td width=\"606\"><br></td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"92\"><br></td>\n" +
                "            <td width=\"606\"><br></td>\n" +
                "        </tr>\n" +
                "    </tbody>\n" +
                "</table>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Суд-экспертлик илмий-тадқиқот институти");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<p>Ўзбекистон Республикаси Адлия вазирлиги ҳузуридаги Х. Сулаймонова номидаги республика суд-экспертиза марказининг суд-экспертлик илмий-тадқиқот институти Ўзбекистон Республикаси Вазирлар Маҳкамасининг 22.11.2021 йилдаги 704-сон &ldquo;Ўзбекистон Республикаси Адлия вазирлиги ҳузуридаги Х. Сулаймонова номидаги республика суд-экспертиза марказининг суд-экспертлик илмий-тадқиқот институти фаолиятини ташкил этиш чора-тадбирлари тўғрисида&rdquo; қарорига асосан ташкил этилган.</p>\n" +
                "<p>Қарорга асосан Институт суд-экспертлик фаолияти соҳасига замонавий илмий ёндашувларни қўллаш орқали унинг самарадорлигини ошириш, ушбу соҳадаги илмий-тадқиқот ишларини янги босқичга кўтариш, давлат суд-экспертиза муассасалари ва нодавлат суд-экспертиза ташкилотларига илмий-услубий жиҳатдан кўмаклашиш, уларнинг фаолиятини ривожлантириш ҳамда такомиллаштиришда иштирок этади.</p>\n" +
                "<p>Шунингдек, суд-экспертиза фаолиятини илмий-услубий жиҳатдан таъминлаш, шунингдек, илмий ва илмий-техник фаолият натижаларидан экспертлик амалиётида фойдаланишни кенгайтириш мақсадида Институтнинг Идоралараро илмий-услубий кенгаши ташкил этилган.</p>\n" +
                "<p><strong>Қуйидагилар Институтнинг асосий вазифалари ҳисобланади:</strong></p>\n" +
                "<ul>\n" +
                "    <li>суд экспертизаси соҳасида илмий-тадқиқот ишларини амалга ошириш;</li>\n" +
                "    <li>давлат суд-экспертиза муассасалари ва нодавлат суд-экспертиза ташкилотларига илмий-услубий кўмак бериш;</li>\n" +
                "    <li>суд-экспертлик вазифаларини ҳал қилишнинг илмий асосларини такомиллаштириш ва ягона илмий-методик ёндашувларини ишлаб чиқиш;</li>\n" +
                "    <li>суд, ҳуқуқни муҳофаза қилувчи органлар, таълим муассасалари ва илмий ташкилотларга услубий ёрдам кўрсатиш;</li>\n" +
                "    <li>суд-экспертлик фаолиятига фан ва техника ютуқларини жорий этиш бўйича чораларни кўриш;</li>\n" +
                "    <li>суд экспертизаси соҳасидаги тизимли муаммоларни комплекс ўрганиш ва уларни ҳал этишга доир илмий асосланган таклифлар ва таъсирчан механизмларни ишлаб чиқиш;</li>\n" +
                "    <li>ҳуқуқни муҳофаза қилувчи органлар ва судларнинг малакали суд экспертиза хулосаларига бўлган эҳтиёжларини доимий равишда ўрганиш орқали суд экспертизасининг янги турлари ҳамда услубиётларини ишлаб чиқиш ва босқичма-босқич амалиётга татбиқ этиш бўйича таклифлар киритиш;</li>\n" +
                "    <li>суд экспертизаси соҳасига ривожланган ахборот технологиялари ва инновацияларни кенг жорий қилиш бўйича таклифлар ишлаб чиқиш.</li>\n" +
                "</ul>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Нодавлат суд эксперти бўлиш учун қўйиладиган талаблар");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<p>Нодавлат суд-экспертиза ташкилотида суд эксперти лавозимини олий маълумотга, алоҳида ҳолларда эса ўрта махсус, касб-ҳунар маълумотига эга бўлган шахслар эгаллаши мумкин.</p>\n" +
                "<p>Нодавлат суд-экспертиза ташкилотининг раҳбари олий маълумотли бўлиши шарт.</p>\n" +
                "<p>Белгиланган тартибда муомалага лаёқатсиз ёки муомала лаёқати чекланган деб топилган, қасддан содир этган жиноятлари учун судланганлик ҳолати тугалланмаган ёки судланганлиги олиб ташланмаган шахс суд эксперти сифатида жалб этилиши мумкин эмас.</p>\n" +
                "<p>Нодавлат суд-экспертиза ташкилоти раҳбари ва суд экспертлари ҳар икки йилда малакаси ва ҳуқуқий билимларини оширишлари лозим.</p>\n" +
                "<p>Нодавлат суд-экспертиза ташкилотининг суд эксперти томонидан қонунчиликда белгиланган тартибда суд эксперти сертификатини олмасдан туриб ёки ҳар икки йилда малакаси ва ҳуқуқий билимини оширмасдан суд экспертизаси ўтказилишига йўл қўйилмайди.</p>\n" +
                "<p>Суд эксперти сертификатини олгандан кейин узлуксиз равишда беш йил давомида ўз ихтисослиги бўйича суд-экспертлик фаолиятини олиб бормаган шахс фақат қайта тайёрлаш курсларидан такроран муваффақиятли ўтгандан кейин суд экспертизасини ўтказишга ҳақли.</p>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Нодавлат суд экспертиза ташкилотлари томонидан ўтказиладиган тадқиқот турлари рўйхати");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<p>Нодавлат суд-экспертиза ташкилотлари Ўзбекистон Республикаси Президентининг &laquo;Суд-экспертлик фаолиятини янада такомиллаштириш чора-тадбирлари тўғрисида&raquo; 2019 йил 17 январдаги ПҚ-4125-сон қарорига <a href=\"https://lex.uz/docs/4172023#4173829\">1-иловада</a> кўрсатилган суд экспертизаларини амалга оширишга ҳақли.</p>\n" +
                "<h4>Нодавлат суд-экспертиза ташкилотлари томонидан ўтказилишига рухсат берилган суд экспертизалари турларининг<br>РЎЙХАТИ</h4>\n" +
                "<table>\n" +
                "    <tbody>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">\n" +
                "                <h5>Т/р</h5>\n" +
                "            </td>\n" +
                "            <td width=\"91%\">\n" +
                "                <h5>Экспертиза турлари</h5>\n" +
                "            </td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">1.</td>\n" +
                "            <td width=\"91%\">Суд-хатшунослик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">2.</td>\n" +
                "            <td width=\"91%\">Ҳужжатларнинг суд-техникавий экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">3.</td>\n" +
                "            <td width=\"91%\">Суд-санъатшунослик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">4.</td>\n" +
                "            <td width=\"91%\">Суд-портрет экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">5.</td>\n" +
                "            <td width=\"91%\">Суд-трасологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">6.</td>\n" +
                "            <td width=\"91%\">Толали материаллар ва улардан тайёрланган маҳсулотларнинг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">7.</td>\n" +
                "            <td width=\"91%\">Полимер материаллар ва улардан тайёрланган маҳсулотларнинг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">8.</td>\n" +
                "            <td width=\"91%\">Лок-бўёқ материаллари ва қопламаларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">9.</td>\n" +
                "            <td width=\"91%\">Суд-тупроқшунослик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">10.</td>\n" +
                "            <td width=\"91%\">Нефть маҳсулотлари ва ёқилғи-мойлаш материалларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">11.</td>\n" +
                "            <td width=\"91%\">Табиий минераллар суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">12.</td>\n" +
                "            <td width=\"91%\">Шиша буюмлари ва силикатли қурилиш материалларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">13.</td>\n" +
                "            <td width=\"91%\">Металл буюмлари ва қотишмаларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">14.</td>\n" +
                "            <td width=\"91%\">Дори воситаларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">15.</td>\n" +
                "            <td width=\"91%\">Табиати номаълум моддаларнинг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">16.</td>\n" +
                "            <td width=\"91%\">Таркибида спирт бўлган суюқликлар ва уларнинг излари суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">17.</td>\n" +
                "            <td width=\"91%\">Махсус маркерлар (кўрсаткичлар) суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">18.</td>\n" +
                "            <td width=\"91%\">Озиқ-овқат маҳсулотларининг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">19.</td>\n" +
                "            <td width=\"91%\">Суд-биологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">20.</td>\n" +
                "            <td width=\"91%\">Суд-ботаник экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">21.</td>\n" +
                "            <td width=\"91%\">Суд-зоологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">22.</td>\n" +
                "            <td width=\"91%\">Суд-орнитология экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">23.</td>\n" +
                "            <td width=\"91%\">Суд-ихтиологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">24.</td>\n" +
                "            <td width=\"91%\">Одам ДНКси суд-биологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">25.</td>\n" +
                "            <td width=\"91%\">Суд-транспорт-трасология экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">26.</td>\n" +
                "            <td width=\"91%\">Суд-транспорт-баҳолаш экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">27.</td>\n" +
                "            <td width=\"91%\">Суд-иқтисодий экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">28.</td>\n" +
                "            <td width=\"91%\">Суд-бухгалтерия экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">29.</td>\n" +
                "            <td width=\"91%\">Суд-молия-кредит экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">30.</td>\n" +
                "            <td width=\"91%\">Меҳнат иқтисодиёти суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">31.</td>\n" +
                "            <td width=\"91%\">Суд-режали-иқтисодиёт экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">32.</td>\n" +
                "            <td width=\"91%\">Суд-иқтисодий-статистик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">33.</td>\n" +
                "            <td width=\"91%\">Ташқи савдо фаолиятининг суд-иқтисодий экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">34.</td>\n" +
                "            <td width=\"91%\">Суд-қурилиш-техникавий экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">35.</td>\n" +
                "            <td width=\"91%\">Суд-ер экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">36.</td>\n" +
                "            <td width=\"91%\">Суд-товаршунослик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">37.</td>\n" +
                "            <td width=\"91%\">Суд-фонография экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">38.</td>\n" +
                "            <td width=\"91%\">Видеоматериалларнинг суд экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">39.</td>\n" +
                "            <td width=\"91%\">Суд-экологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">40.</td>\n" +
                "            <td width=\"91%\">Суд-сиёсатшунослик-лингвистик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">41.</td>\n" +
                "            <td width=\"91%\">Суд-филологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">42.</td>\n" +
                "            <td width=\"91%\">Суд-компьютер-техникавий экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">43.</td>\n" +
                "            <td width=\"91%\">Суд-психологик экспертизаси</td>\n" +
                "        </tr>\n" +
                "        <tr>\n" +
                "            <td width=\"8%\">44.</td>\n" +
                "            <td width=\"91%\">Суд-электротехникавий экспертизаси</td>\n" +
                "        </tr>\n" +
                "    </tbody>\n" +
                "</table>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Нодавлат суд экспертиза ташкилотини ташкил этиш тартиби");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("Ўзбекистон Республикаси Вазирлар Маҳкамасининг «Нодавлат суд-экспертиза ташкилотлари фаолиятини ташкил этиш бўйича низомларни тасдиқлаш ҳақида» 180-сон қарори 2020 йил 24 март куни қабул қилинди.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти фуқаролик, иқтисодий, жиноят ва маъмурий суд ишлари бўйича суд экспертизасини ўтказишга ихтисослаштирилган, штатида суд эксперти сертификатига эга мутахассислар (кейинги ўринларда суд эксперти деб юритилади) бўлган ташкилот ҳисобланади.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти юридик шахс шаклида ташкил этилади.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти раҳбари сифатида фақат суд эксперти фаолият олиб бориши мумкин.\n" +
                "\n" +
                "Суд эксперти фақат битта нодавлат суд-экспертиза ташкилотининг муассиси (иштирокчиси) бўлиши мумкин.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти суд экспертизасини ўтказишда давлат суд-экспертиза муассасалари каби функцияларни амалга оширади, улар каби ҳуқуққа эга бўлади, мажбуриятларни бажаради ва жавобгар ҳисобланади.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти фақат суд экспертизасини амалга ошириш фаолияти билан шуғулланишга ҳақли.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилотининг фирма номида унинг нодавлат суд-экспертиза ташкилоти эканлиги кўрсатилиши шарт.\n" +
                "\n" +
                "Нодавлат суд-экспертиза ташкилоти штатида унинг раҳбаридан ташқари бир хил ёки турли хил суд экспертизаси йўналиши бўйича суд эксперти сертификатига эга камида икки нафар суд эксперти бўлиши лозим.");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Суд экспертиза соҳасида аккредитация");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<p>Бугунги кунда Адлия вазирлиги ҳузуридаги Х.Сулаймонова номидаги Республика суд экспертизаси Марказининг фаолияти энг сўнгги замонавий инновацион технологиялар ва жаҳон талабларига жавоб берадиган халқаро стандарт меъёрлари бўйича фаолият олиб бормоқда. &nbsp;Суд экспертиза соҳасида суд экспертлик фаолияти, хусусан &nbsp;ўтказилаётган тадқиқотларни халқаро стандарт талабларига мувофиқлигини аниқлаш ва аккредитациядан ўтказиш суд экспертиза муассасалари фаолияти сифатини оширишда муҳим ўрин тутади. Суд экспертлик фаолиятини олиб борувчи ташкилотнинг халқаро аккредитациядан ўтганлиги экспертиза тайинлайдиган орган (шахс)га &nbsp;суд экспертиза лабораториясини танлашда асосли қарор қабул қилишига имкон беради, чунки аккредитация ташкилот томонидан бериладиган хизмат турлари ва тадқиқотларининг сифати, ваколати, холислиги ва кенг имкониятларини намойиш этади.<br>Аккредитация:</p>\n" +
                "<ul>\n" +
                "    <li>суд-экспертиза лабораториялари фаолияти илмий-техник даражаси ва суд эксперт хулосаларининг ишончлилигини &nbsp;оширишга;</li>\n" +
                "    <li>&nbsp;ушбу лабораториялар фаолиятини баҳолашни &nbsp;объективлаштиришни ва суд эксперт хулосаларини суд жараёнидаги шубҳасиз тан олинишига;</li>\n" +
                "    <li>ашёвий далилларни текширишни ва ташкилотнинг суд-экспертлик технологияларини муқобиллаштиришга, хусусан экспертиза ижро муддатларини қисқартилишига;</li>\n" +
                "    <li>суд эксперт хулосаларининг нафақат маҳаллий суд ва тергов жараёнларида, балки хорижий ва халқаро суд жараёнларида ҳам қўлланилишига имконият яратади.</li>\n" +
                "</ul>\n" +
                "<p>Марказ фаолиятида &nbsp;сифат менежментини жорий этиш ишлари<br>2015 йилда бошланган бўлиб, дастлаб Марказ ИСО 9001:2015 &ldquo;Сифат менежмент тизими. Талаблар&rdquo; стандарт талабларига кўра, &ldquo;Производство судебных экспертиз и исследований&rdquo; аккредитация доираси бўйича CЕРТ ИНТЕРНАТИОНАЛ халқаро сертификация органи томонидан Аккредитациядан ўтказилиб, танланган аккредитация доираси бўйича Марказ фаолиятини стандарт талабларига кўра бажарилишида мувофиқлик аниқланган ва №ҚМС-0117/А Аккредитация сертификатига эга бўлган.<br>Марказ фаолиятида сифат менежмент тизимини ISO/IEC 17025 стандарт талаблари бўйича ташкил этиш ва амалиётга татбиқ этиш, Марказ лабораторияларини мазкур стандарт талабларига мувофиқ халқаро аккредитациядан ўтказиш билан боғлиқ ишлар 2017 йилдан бошлаб амалга оширилди. Молиявий ва ташкилий ишлар БМТнинг гиёҳвандлик ва жиноятчиликка қарши курашишнинг Марказий Осиёдаги минтақавий ваколатхонасининг Марказий Осиё давлатлари учун 2015-2020 йилларга мўлжалланган &ldquo;Илмий тадқиқотлар ва тенденциялар таҳлили&rdquo; мавзусидаги лойиҳасининг &ldquo;Ўзбекистон Республикаси Ички Ишлар Вазирлиги ва Адлия вазирлиги эксперт-криминалистик лабораториялари имкониятларини мустаҳкамлаш&rdquo; &nbsp;компоненти доирасида бажарилди.<br>Халқаро аккредитациядан ўтиш жараёни бир неча мураккаб босқичларни ўз ичига олиб, стандарт талабига кўра махсус ички ҳужжатлар тизимини ишлаб чиқишни ва уларни амалиётга жорий этишни тақозо этади. Шунга кўра, Марказ Сифат менежментининг энг асосий Сифат соҳасидаги Сиёсати, Сифат бўйича қўлланмаси, 19 та умумий жараён ҳужжатлари, танланган аккредитация доиралари бўйича техник жараён ҳужжатлари (СОП) ва йўриқномалари ишлаб чиқилди ҳамда амалиётга татбиқ этилди. &nbsp;Лабораторияларнинг моддий техник базаси янгиланди, энг сўнгги замонавий техник ускуналар ва воситалар билан жиҳозланди. ISO/IEC 17025:2017 стандарт талаблари бўйича ходимлар махсус тренинг курсларида ўқитилиб, стандарт талабларига кўра тадқиқотларни ўтказиш ва уларни расмийлаштириш тартиби бўйича малака ва кўникмалари оширилди. &nbsp;Танланган аккредитация доиралари бўйича халқаро аккредитатланган провайдерларнинг &nbsp;Профессионал тест текширувларида иштирок этилди, усуллар валидацияси ва верификацияси ўтказилди.<br>2020 йил 14-17 март кунлари Марказнинг Одам ДНКси суд биологик экспертизаси лабораторияси ва Материаллар, ашёлар ва буюмлар криминалистик экспертизаси &nbsp;лабораториялари ГОСТ ISO/IEC 17025-2019 (ISO/IEC 17025:2017) &laquo;Тадқиқот ва калибрлаш лабораторияларининг ваколатлилигига қўйиладиган умумий талаблар&raquo; стандарт талаблари бўйича Қозоғистон Республикаси Миллий Аккредитация Маркази томонидан ташқи аудит текширувидан ўтказилиб, Марказ лабораториялари фаолиятининг стандарт талабларига мувофиқлиги ҳақидаги ижобий хулосаси олинди.<br>2020 йил 23 июнь кунидаги &nbsp;Қозоғистон Республикаси Миллий Аккредитация Марказининг №532-ОД сонли буйруғига кўра, Х.Сулаймонова номидаги Республика Суд экспертизаси Маркази халқаро аккредитациядан ўтган ташкилотлар рўйхатига қўшилди ва &ldquo;Наркотик моддаларни идентификация қилиш (ТГК, кодеин, морфин, героин)&rdquo; ва &ldquo;ДНКни аниқлаш: одам қони ва сўлаги&rdquo; (Оталикни (оналикни) аниқлаш экспертизалари) аккредитатсия доиралари бўйича ўтказиладиган экспертиза тадқиқотларини ГОСТ ISO/IEC 17025-2019 (ISO/IEC 17025:2017) стандарт талабларига жавоб бериши ҳақидаги Аккредитация Аттестати (№ КЗ.Т.00.2341) га эга бўлди. Марказ Ўзбекистон Республикасида суд экспертлик фаолияти билан шуғулланувчи ташкилотлар ичида биринчи бўлиб ГОСТ ISO/IEC 17025-2019 (ISO/IEC 17025:2017) стандарт талабларига мувофиқ Аккредитация жараёнини ўтказди.<br>2019 йил 17 январдаги ПҚ-4125-сон қарори билан тасдиқланган &ldquo;Йўл харитаси&rdquo;нинг 7-банди юзасидан ишлаб чиқилган чора-тадбирлар режасига мувофиқ ҳамда БМТнинг гиёҳвандлик ва жиноятчиликка қарши курашишнинг Марказий Осиёдаги минтақавий ваколатхонасининг &ldquo;Ўзбекистон Республикасида суд экспертиза ташкилотларининг &nbsp;имкониятларини мустаҳкамлаш-фаза ИИ&rdquo; номли навбатдаги лойиҳаси доирасида эндиликда Марказнинг Суд фонография экспертизаси ва Ҳужжатлар криминалистик экспертизаси лабораторияларини ҳам ГОСТ ISO/IEC 17025-2019 (ISO/IEC 17025:2017) стандарт талаблари бўйича халқаро аккредитациядан ўтказиш ишлари бошланган ва келгусида танланган аккредитация соҳаларини янада кенгайтириш масаласи кўриб чиқилмоқда.</p>");
        payloadList.add(newsPayload);

        newsPayload = new NewsPayload();
        newsPayload.setDate("01-27-2021");
        newsPayload.setTitle("Суд экспертларини малакаси ва ҳуқуқий билимларини ошириш тартиби");
        newsPayload.setImgUrl("https://sudexpert.uz/wp-content/uploads/2022/11/cropped-176073_430b9b0294c4242bf21122fb1a121.jpg");
        newsPayload.setBody("<div>\n" +
                "    <div>\n" +
                "        <div>\n" +
                "            <div>\n" +
                "                <div>\n" +
                "                    <article>\n" +
                "                        <div>\n" +
                "                            <p>Суд экспертларининг малакасини ва ҳуқуқий билимларини ошириб бориш Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2017 йил 13 апрелдаги &ldquo;Ўзбекистон Республикаси Адлия вазирлиги ҳузуридаги Х.&nbsp;Сулаймонова номидаги Республика суд экспертизаси маркази фаолиятини янада такомиллаштириш ҳамда суд экспертларининг малакасини ошириш тизимини ташкил қилиш тўғрисида&rdquo;ги 206-сон қарори асосида амалга оширилади.</p>\n" +
                "                            <p>Суд экспертларининг малакасини ошириб бориш суд экспертларининг малакасини оширишга қўйиладиган давлат талабларига мос равишда амалга оширилади.</p>\n" +
                "                            <p>Суд экспертларининг малакасини ошириб бориш вазирликлар ва идоралар томонидан мустақил равишда амалга оширилади.</p>\n" +
                "                            <p>Суд экспертларининг ҳуқуқий билимларини ошириб бориш Ўзбекистон Республикаси Адлия вазирлиги ҳузуридаги Х. Сулайманова номидаги Республика суд экспертизаси марказининг (кейинги ўринларда Суд экспертизаси маркази деб аталади) Суд экспертларининг малакасини ошириш ўқув марказида (кейинги ўринларда Ўқув маркази деб аталади) вазирликлар ва идораларнинг тақдим қилинадиган буюртмасига асосан амалга оширилади.</p>\n" +
                "                            <p>Ўқув марказида суд экспертларининг ҳуқуқий билимларини ошириб бориш харажатлари, шунингдек Ўқув марказига асосий ишдан ажралган ҳолда бошқа ҳудудлардан юборилган суд экспертларининг ўқиш жойига келиши ва у ердан қайтиши бўйича бир марталик йўл харажатлари, хизмат сафари бўйича харажатлар вазирликлар ва идораларнинг бюджет ва бюджетдан ташқари маблағлари ҳисобидан қопланади.</p>\n" +
                "                            <p>&nbsp;Суд экспертлари ҳар икки йилда малакасини ва ҳуқуқий билимларини ошириб бориши шарт.</p>\n" +
                "                            <p>Малакани ва ҳуқуқий билимларни ошириш ўз ихтисослиги бўйича камида икки йиллик иш стажига эга бўлган суд экспертлари учун ташкил қилинади.</p>\n" +
                "                            <p>Вазирликлар ва идоралар:</p>\n" +
                "                            <p>суд экспертларининг малакасини ошириш тизимида ўқиши лозим бўлган суд экспертларининг эҳтиёжини аниқлайди ва таркибини шакллантиради;</p>\n" +
                "                            <p>ҳуқуқий билимларини ошириб бориш бўйича ўқув машғулотларини ўтказишда Ўқув марказига ташкилий-методик жиҳатдан кўмаклашади;</p>\n" +
                "                            <p>суд экспертларининг малакасини ошириш бўйича ўқув дастурларини ишлаб чиқади;</p>\n" +
                "                            <p>суд экспертларининг ҳуқуқий билимларини ошириб бориш бўйича ўқув жараёни сифатини мониторинг қилади.</p>\n" +
                "                            <p>Вазирликлар ва идоралар суд экспертларининг малакасини ва ҳуқуқий билимларини оширишнинг тўлиқлиги ва ўз вақтида амалга оширилиши учун масъулдирлар.</p>\n" +
                "                        </div>\n" +
                "                    </article>\n" +
                "                    <article>\n" +
                "                        <h5>Суд экспертларининг малакасини ва ҳуқуқий билимларини ошириш бўйича ўқув жараёнини ташкил этиш тартиби</h5>\n" +
                "                        <div>\n" +
                "                            <p>Ўқув жараёнини ташкил этиш Ўқув маркази ҳамда вазирликлар ва идоралар томонидан Суд экспертларининг малакасини оширишга қўйиладиган давлат талабларига жавоб берадиган ўқув дастурлари асосида амалга оширилади.</p>\n" +
                "                            <p>Ўқув жараёни гуруҳ таркибида суд экспертизаларининг бир тури бўйича ташкил этилади.</p>\n" +
                "                            <p>Суд экспертларининг малакасини ва ҳуқуқий билимларини оширишни самарали ташкил қилиш учун Ўқув маркази ҳамда вазирликлар ва идоралар:</p>\n" +
                "                            <p>ўқитишнинг замонавий педагогик услублари, мультимедиа ва ахборот-коммуникация технологияларини қўллаган ҳолда, суд экспертизаларининг турлари бўйича таҳлилий қобилиятларни ва ижодий фикрлашни ривожлантиришга қаратилган алоҳида ўқув режа ва дастурларини ишлаб чиқади ва тасдиқлайди;</p>\n" +
                "                            <p>фанларнинг суд экспертиза амалиёти билан алоқасини таъминлайди, ўқув жараёнининг амалий йўналтирилганлигини, мустақил таълимни, ўқув жараёнини суд экспертизаси фаолиятидаги вазифаларни самарали бажаришга йўналтирилганлигини кучайтиради, ўқув жараёнига суд экспертизаси соҳасидаги илғор илмий-тадқиқотлар натижалари, педагогик технологиялар, машғулотлар ўтказишнинг самарали шакл ва услубларини жорий этади;</p>\n" +
                "                            <p>суд экспертлари томонидан ўз мутахассислиги бўйича янги назарий билимлар ва замонавий тадқиқот усуллари, илғор амалий тажрибалар, шунингдек иш фаолиятларида ахборот-технологияларидан фойдаланиш кўникмаларини ривожлантиришни таъминлайди;</p>\n" +
                "                            <p>ўқув жараёнига таълимнинг интерфаол усуллари, замонавий педагогика технологияларини, шунингдек Интернет жаҳон ахборот тармоғидан фойдаланиб, ахборот-коммуникация ва масофали таълим технологияларини татбиқ қилади;</p>\n" +
                "                            <p>мамлакатимизда ва хорижда ишлаб чиқилган суд экспертизаси фанларига тааллуқли илмий, услубий ва техник янгиликлар, илғор тажрибаларни ўрганади ҳамда ўқув жараёнига жорий қилади;</p>\n" +
                "                            <p>суд экспертларининг малакасини ва ҳуқуқий билимларини ошириш бўйича халқаро тажрибани ўрганади, шу соҳа бўйича тажриба алмашишни ташкил қилади;</p>\n" +
                "                            <p>ўқув жараёнига оид махсус фанлар бўйича адабиётларни ишлаб чиқади;</p>\n" +
                "                            <p>суд экспертизаси тадқиқотлари методикаларини такомиллаштириш, янги турдаги экспертизаларни жорий қилиш, ўқув жараёнини ривожлантиришга оид мавзуларда конференция, симпозиум ва семинарлар ташкил қилади ҳамда бундай анжуманларда иштирок этади;</p>\n" +
                "                            <p>ўқув жараёнининг лозим даражада ташкил қилиниши ва ўтказилиши учун жавобгар бўлади.</p>\n" +
                "                            <p>Ўқув жараёни муайян йўналиш бўйича циклик машғулотлар (кун давомида бошқа турдаги машғулотларга жалб этмасдан) тарзида амалга оширилади.</p>\n" +
                "                            <p>Суд экспертларининг малакасини ошириш жараёнида малакавий амалиёт (стажировка) ўтказилиши назарда тутилади.</p>\n" +
                "                            <p>Суд экспертларининг ҳуқуқий билимларини ошириб бориш вазирликлар ва идораларнинг буюртмаларига биноан Суд экспертизаси маркази томонидан тасдиқланган режа-график асосида амалга оширилади.</p>\n" +
                "                            <p>Ўқув марказига суд экспертларини қабул қилиш Суд экспертизаси маркази директорининг буйруғи билан расмийлаштирилади.</p>\n" +
                "                            <p>Малака ва ҳуқуқий билимларини оширишни ўтаётган суд экспертларига ўқишнинг бутун даври мобайнида асосий иш жойи бўйича эгаллаб турган лавозими ва ўртача ойлик иш ҳақи сақлаб қолинади.</p>\n" +
                "                            <p>Ўқув марказига жалб қилинган суд экспертлари ўқув жараёнидан қуйидаги ҳолатларда четлаштирилади:</p>\n" +
                "                            <p>Суд экспертизаси марказининг ички тартиб-қоидаларини бузганлик учун;</p>\n" +
                "                            <p>ўқув дастурларини ўзлаштирмаганлик учун;</p>\n" +
                "                            <p>узрли сабабларсиз 8 академик соатдан кўп ўқув машғулотларини қолдирганлик учун.</p>\n" +
                "                            <p>Узрли сабабларга кўра ёки ўқишнинг даврийлиги ва талабларига биноан ўқишни давом эттира олмаган суд эксперти ўз аризасига кўра ўқув жараёнидан четлаштирилиши мумкин.</p>\n" +
                "                            <p>Узрли сабабларга кўра ўқишни давом эттира олмаган суд экспертига келгусида ташкил этиладиган ўқув гуруҳларида ўқиш имкони берилади.</p>\n" +
                "                            <p>Ўқув марказига жалб қилинган суд экспертларини ўқув жараёнидан четлаштириш Суд экспертизаси маркази директорининг буйруғи билан расмийлаштирилади ва бу ҳақда вазирликлар ва идораларга хабар берилади.</p>\n" +
                "                        </div>\n" +
                "                    </article>\n" +
                "                    <article>\n" +
                "                        <h5>Суд экспертларининг малакасини ва ҳуқуқий билимларини ошириш шакллари</h5>\n" +
                "                        <div>\n" +
                "                            <p>Суд экспертларининг малакасини ва ҳуқуқий билимларини ошириш бевосита ва билвосита шаклларда амалга оширилади.</p>\n" +
                "                            <p>&nbsp;Бевосита шаклда малакани ва ҳуқуқий билимларни ошириш қуйидагича ташкил қилинади:</p>\n" +
                "                            <p>ўқув жараёнида иштирок этиш &mdash; ўқув дастурларига мос ҳолда янги назарий ва амалий билимлар, малака ва кўникмаларни ўзлаштириш;</p>\n" +
                "                            <p>давлат суд экспертизаси муассасаларида малакавий амалиёт (стажировка) ўташ &mdash; суд экспертларининг амалий билимлари, кўникма ва малакаларини кенгайтириш ва чуқурлаштириш ҳамда ўқув жараёнида олган назарий билимларини амалиётда қўллаш.</p>\n" +
                "                            <p>Суд экспертлари малакавий амалиёт (стажировка) ўташни хорижий давлатларнинг суд экспертлари малакасини оширишга ихтисослашган муассасаларида Ўзбекистон Республикасининг халқаро шартномалари ҳамда вазирлик, идоралар ва давлат суд экспертизаси муассасалари билан хорижий давлатларнинг тегишли муассасалари ўртасида тузилган шартномалар, шунингдек хорижий давлатлар ва халқаро ташкилотлар томонидан суд экспертизаси муассасаларини ривожлантириш мақсадида ажратиладиган грантлар асосида амалга оширишлари мумкин.</p>\n" +
                "                            <p>Билвосита шаклда малакани ва ҳуқуқий билимларини ошириш &mdash; суд экспертларининг масофадан туриб амалга ошириладиган таълим, ўз билимини мустақил ошириши, тажриба алмашиши, давлат суд экспертизаси муассасалари ва Ўқув маркази томонидан ташкил этиладиган экспертларнинг семинар, давра суҳбати ва конференцияларда ҳамда бошқа шу каби тадбирларда иштирок этиши ва маърузалар билан чиқиши орқали амалга оширилади.</p>\n" +
                "                            <p>Масофадан туриб амалга ошириладиган таълим ахборот-коммуникация технологияларига асосланади ва асосий ишдан ажрамаган ҳолда ташкил этилади.</p>\n" +
                "                            <p>Масофадан туриб амалга ошириладиган таълим тегишли ўқув дастури асосида ташкил қилинади ҳамда малака оширишнинг мустақил шакли сифатида ёки малакани ва ҳуқуқий билимларни ошириш бевосита шаклининг такрибий қисми сифатида амалга оширилиши мумкин.</p>\n" +
                "                            <p>Суд экспертлари ўзининг билим, кўникма ва малакасини мустақил тарзда ошириб боришлари шарт. Мустақил таълим суд-экспертлик фаолиятининг ажралмас таркибий қисми ҳисобланади.</p>\n" +
                "                        </div>\n" +
                "                    </article>\n" +
                "                    <article>\n" +
                "                        <h5>Суд экспертларининг малакасини ва ҳуқуқий билимларини ошириш бўйича ўқув жараёнининг муддати ва давомийлиги</h5>\n" +
                "                        <div>\n" +
                "                            <p>Вазирликлар ва идоралар томонидан суд экспертларининг малакасини ошириш муддати икки ҳафтадан кам бўлмаслиги керак.</p>\n" +
                "                            <p>Ўқув марказида суд экспертларининг ҳуқуқий билимларини ошириб бориш бир ҳафтадан кам бўлмаган муддатда ташкил этилади.</p>\n" +
                "                            <p>Ўқув жараёни ҳафтасига кўпи билан 36 академик соат ҳажмида амалга оширилади.</p>\n" +
                "                            <p>Масофали таълимда ўқитиш муддати ўқув жараёни муддатига мос ҳолда академик соатлар билан аниқланади.</p>\n" +
                "                        </div>\n" +
                "                    </article>\n" +
                "                    <article>\n" +
                "                        <h5>Суд экспертлари билимини баҳолаш</h5>\n" +
                "                        <div>\n" +
                "                            <p>Ўқув жараёнига жалб қилинган суд экспертлари билимларини баҳолаш якуний назоратлар натижасига кўра амалга оширилади.</p>\n" +
                "                            <p>Малакани ошириш бўйича якуний назорат вазирликлар ва идораларда (Ўзбекистон Республикаси Адлия вазирлиги тизимидаги суд экспертлари учун &ndash;Ўқув марказида) тест ёки ёзма имтиҳон шаклида ўтказилади.</p>\n" +
                "                            <p>Ҳуқуқий билимларни ошириш бўйича якуний назорат Ўқув марказида тест ёки ёзма имтиҳон ҳамда ўқиш даврида олинган назарий билимлар ва амалий кўникмаларни аниқлашга қаратилган суҳбат шаклида ўтказилади.</p>\n" +
                "                            <p>Якуний назоратларни ташкил этиш ва ўтказиш учун вазирликлар ва идоралар раҳбарлари ва Суд экспертизаси маркази директорининг буйруқлари билан комиссиялар ташкил этилади.</p>\n" +
                "                            <p>Ўқув марказида ташкил этиладиган комиссия таркибига вазирликлар ва идоралар, олий таълим муассасалари ва бошқа ташкилотларнинг вакиллари улар билан келишилган ҳолда киритилиши мумкин.</p>\n" +
                "                            <p>Якуний назоратлар натижалари комиссиялар аъзолари томонидан имзоланадиган қайднома варақаларига киритилади.</p>\n" +
                "                            <p>Якуний назоратлардан ўта олмаган ёки узрли сабабларга кўра уларда иштирок эта олмаган суд экспертига, унинг аризасига биноан, уч кун муддатда тегишли якуний назоратни қайта топшириш имкони берилади.</p>\n" +
                "                            <p>Ҳуқуқий билимларни оширишдан ўтмаган ходимлар ҳақидаги маълумотнома Суд экспертизаси маркази томонидан зарур чоралар кўриш учун вазирликлар ва идораларга юборилади.</p>\n" +
                "                            <p>Малакани ва/ёки ҳуқуқий билимларни оширишдан ўтмаган ходимларнинг суд-экспертлик фаолияти билан шуғулланиши ҳамда уларни суд-экспертлик фаолиятига жалб қилиш тақиқланади.</p>\n" +
                "                        </div>\n" +
                "                    </article>\n" +
                "                </div>\n" +
                "            </div>\n" +
                "        </div>\n" +
                "    </div>\n" +
                "</div>\n" +
                "<div>\n" +
                "    <div>\n" +
                "        <div>\n" +
                "            <div>\n" +
                "                <div><em><br></em></div>\n" +
                "            </div>\n" +
                "        </div>\n" +
                "    </div>\n" +
                "</div>");
        payloadList.add(newsPayload);


        System.out.println(payloadList.size()+"=size");
        return newsService.saveNewsList(payloadList);
    }


}
